Revit 2026 API

# ConduitSizeIterator Properties

---

The ConduitSizeIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace